require 'codeTable'

templateCode = $codeTable.keys.map{|k| "[/#{k}/g, \"#{$codeTable[k]}\"]"}.join ","

$stdout = File.open("../lib/hipconverter.js", "w+")

#	templates:[[/((w\\ò)|ô|(_ïñ))\\/g,"$1\\"],[/([À-ß])='/g,"$1$$"],[/([À-ß])=`/g,"$1%%"],[/([^À-ß])#/g,"¤"],[/([À-ß])=/g,"$1#"],[/([À-ß])~/g,"$1&&"],[/([À-ß])`/g,"$1@"],[/(À-ß)\\ú/g,"$1_"],[/_Î[Óó]='/g,""],[/J[Àà]='/g,""],[/_Î[Óó]=/g,"¡"],[/J[Àà]=/g,"K"],[/_Ï[Ññ]/g,"P"],[/_Î[Óó]/g,"U"],[/_Ê[Ññ]/g,"X"],[/(À-ß)^/g,"$1^"],[/(À-ß)'/g,"$1~"],[/_îó='/g,""],[/J[Üü]/g,"İ"],[/J[Àà]/g,"ß"],[/jü\^/g,"B"],[/ä\\ñ/g,"D"],[/ë\\ä/g,"L"],[/W\\ò/g,"T"],[/ğ\\ñ/g,"r"],[/w\\ò/g,"t"],[/_êñ~/g,"…"],[/_Î='/g,""],[/v\\ã/g,""],[/jà='/g,""],[/_î='/g,"Ÿ"],[/ğ\\ä/g,"®"],[/jà=`/g,"±"],[/\\â/g,"+"],[/\\ú/g,"8"],[/\\õ/g,"<"],[/\\í/g,"="],[/\\ğ/g,">"],[/\\÷/g,"?"],[/\\ñ/g,"c"],[/_Î=/g,"N"],[/\\î/g,"b"],[/\\ä/g,"d"],[/\\ã/g,"g"],[/jà=/g,"k"],[/_î=/g,"n"],[/_ïñ/g,"p"],[/_îó/g,"u"],[/_êñ/g,"x"],[/ÿ=`/g,"|"],[/À='/g,""],[/à='/g,"ƒ"],[/\\ç/g,"ˆ"],[/îó=/g,"¢"],[/I='/g,"£"],[/jü`/g,"¨"],[/jü'/g,"¸"],[/\_å/g,"º"],[/i='/g,"¼"],[/î'/g,"0"],[/='/g,"4"],[/=`/g,"5"],[/\^/g,"6"],[/æ~/g,"9"],[/à`/g,"A"],[/å'/g,"e"],[/ã~/g,"G"],[/w'/g,"H"],[/i`/g,"J"],[/V"/g,"M"],[/_Î/g,"O"],[/_W/g,"Q"],[/ğ~/g,"R"],[/ÿ`/g,"S"],[/ó`/g,"Y"],[/à'/g,"a"],[/û'/g,"h"],[/_i/g,"i"],[/i'/g,"j"],[/ë~/g,"l"],[/v"/g,"m"],[/_î/g,"o"],[/_w/g,"q"],[/ÿ'/g,"s"],[/ó'/g,"y"],[/ó^/g,"{"],[/í~/g,"}"],[/v'/g,"€"],[/à^/g,"†"],[/i^/g,"‡"],[/ÿ^/g,"‰"],[/ß^/g,"Š"],[/i~/g,"‹"],[/W^/g,"Œ"],[/ò~/g,"™"],[/ÿ=/g,"š"],[/v^/g,"›"],[/w=/g,"œ"],[/À=/g,"¥"],[/õ~/g,"¦"],[/÷~/g,"§"],[/ñ~/g,"©"],[/I=/g,"¯"],[/_I/g,"²"],[/à=/g,"´"],[/_ó/g,"µ"],[/à~/g,"¹"],[/i=/g,"¿"],[/jü/g,"ı"],[/jà/g,"ÿ"],[/'/g,"1"],[/`/g,"2"],[/=/g,"3"],[/~/g,"7"],[/F/g,"F"],[/ß/g,"Z"],[/f/g,"f"],[/ÿ/g,"z"],[/@/g,"°"],[/i/g,"³"],[/S/g,"½"],[/s/g,"¾"]],

template = <<TEMPLATE_END
function HipConverter(htmlMode){var _=this;
	_.htmlMode = htmlMode==null?false:htmlMode;
}

HipConverter.version = "2.0.23";

HipConverter.prototype = {
	htmlMode:false,
	templates:[#{templateCode}],
	markup:[
		{re:/\\%\\(/g, repl:"<span class=\\"red\\">"},
		{re:/\\%\\)/g, repl:"</span>"}
	],

	convert: function(txt){var _=this;
		for(var i=0; i<_.templates.length; i++){var tpl=_.templates[i];
			txt = txt.replace(tpl[0], tpl[1]);
		}
		if(_.htmlMode){
			for(var i=0; i<_.markup.length; i++){var m=_.markup[i];
				txt = txt.replace(m.re, m.repl);
			}
		}
		else{
			txt = txt.replace(/\\%[\\)\\(]/g, "");
		}
		return txt
	}
};

TEMPLATE_END

puts template

